{"nodes":[{"node":{"Session":"\"Why are these people following me?\"","Speaker(s)":"fhocutt","body":"You've had an idea, or noticed a gap to fill, or wondered why no one's talking about an issue you care about. Like the motivated and competent person you are, you start working, or writing, or...","Experience level":""}},{"node":{"Session":"2014 was the Year of the Linux Desktop. You missed it.","Speaker(s)":"BryanLunduke, bear454","body":"For years we've been hailing \"the year of the linux desktop.\" 2014 was no exception.","Experience level":"Beginner"}},{"node":{"Session":"A developer's-eye view of API client libraries","Speaker(s)":"fhocutt","body":"A developer's experience of an API and its client libraries can make the difference between them building exciting tools based on your project and giving up in frustration.","Experience level":""}},{"node":{"Session":"A Taste of Agile","Speaker(s)":"wphow","body":"Agile methodologies in software development seeks to deliver value to the customer as early in the timeline as possible. It also seeks to build and maintain cadence in the team by assigning the...","Experience level":""}},{"node":{"Session":"ACLU \/ EFF Panel Discussion","Speaker(s)":"schoen","body":"As in previous LinuxFest events, representatives of ACLU-WA and EFF will talk about the past year's important events in online civil liberties, and answer your questions.  There's always lots to...","Experience level":""}},{"node":{"Session":"Adventures in Data Science with Bash","Speaker(s)":"robertaboukhalil","body":"In 2008, Nate Silver wowed the public by correctly predicting the election outcomes in 49 out of 50 states. But you don't have to be a statistician to perform such analyses.","Experience level":"Beginner"}},{"node":{"Session":"Alan Turing & Friends","Speaker(s)":"GDyson","body":"While Benedict Cumberbatch and “The Imitation Game” have brought welcome attention to the role of Alan Turing and his fellow codebreakers in World War II, there is much the film missed.","Experience level":"Intermediate"}},{"node":{"Session":"Alpha Geek","Speaker(s)":"chuckwolber","body":"Time to flex your geek muscle and prove once and for all who this year's Alpha Geek will be. Are you excited?","Experience level":""}},{"node":{"Session":"An Intro to Ceph and Big Data","Speaker(s)":"Paul Bibaud","body":"An introduction to Ceph clusters, Big Data, and how to make it easy to deploy.","Experience level":"Intermediate"}},{"node":{"Session":"An Introduction to Sympy from An Engineer","Speaker(s)":"tfbradbeer","body":"First part of the talk will go into the basics of using sympy to do simple symbolic and some numeric mathematics.","Experience level":"Intermediate"}},{"node":{"Session":"Bitcoin Development: Getting Started on the Block Chain","Speaker(s)":"NoahJudson","body":"The block chain is the revolutionary technology that Bitcoin is built upon.","Experience level":"Beginner"}},{"node":{"Session":"BKO is dead long live bootboot!","Speaker(s)":"warthog9","body":"There existed a project called BKO (boot.kernel.org) that allowed for network booting over the internet.  It spawned child sites like boot.fedoraproject.org, but in late 2011 went offline, never...","Experience level":"Intermediate"}},{"node":{"Session":"Bootstrapping a Language Workbench ","Speaker(s)":"Andronetta Douglass, Jamie Douglass, Alyssa Pavao","body":"Have you ever wanted a programming language specifically for the application you were developing? This is the promise of Domain Specific Languages(DSLs).","Experience level":"Intermediate"}},{"node":{"Session":"Building Better Hackathons","Speaker(s)":"lishevita","body":"Hackathons have become a \"thing\". It seems like everyone is running one, sponsoring one or participating in one. Along with that popularity has come a fair amount of criticism of both the form and...","Experience level":""}},{"node":{"Session":"Building Next Gen PaaS: OpenShift, Docker, Kubernetes, Project Atomic! Oh My!","Speaker(s)":"dmueller","body":"OpenShift by Red Hat is an Apache V2 Open Source Project that has extended the cloud scaling capabilites for Applications of all ilk into the stratosphere.","Experience level":"Beginner"}},{"node":{"Session":"Building Your Linux Firmware Security Toolkit","Speaker(s)":"lee.fisher","body":"This presentation will cover the current open source tools for diagnosing and securing system firmware of Linux systems. The main focus is on the CHIPSEC security tool and the LUV-live and FWTS-...","Experience level":"Advanced"}},{"node":{"Session":"Ceph Intro and Architectural Overview","Speaker(s)":"F2","body":"Ceph is an open source distributed object store, network block device, and file system designed for reliability, performance, and scalability. It runs on commodity hardware, has no single point of...","Experience level":"Beginner"}},{"node":{"Session":"Code for Seattle - A local Civic Hacking movement","Speaker(s)":"willscott, sethvincent","body":"Code for Seattle is a brigade of civic-minded hackers. We'll talk about how we've organized hackathons, a weekly meetup, and successfully navigated the government bureaucracy as a small group...","Experience level":""}},{"node":{"Session":"Considering the Future of Copyleft: How Will The Next Generation Perceive GPL?","Speaker(s)":"bkuhn","body":"Copyleft licenses, particularly the GPL and LGPL, are...","Experience level":"Intermediate"}},{"node":{"Session":"Continuous Integration with Jenkins for creation of RPMs","Speaker(s)":"ap","body":"Continuous Integration tool of Jenkins to  manage RPM \nThis talk will primarily focus on using Continuous Integration tool of Jenkins to  manage RPM creation and deployment .  ","Experience level":"Intermediate"}},{"node":{"Session":"Crowd Sourcing Maps using FOSS","Speaker(s)":"cliffordsnow","body":"OpenStreetMap (OSM) is all about building community. A community of mappers that map what they know best, their local neighborhoods. Or a community of mappers helping out when disasters strikes,...","Experience level":"Beginner"}},{"node":{"Session":"Crushing data silos with ownCloud","Speaker(s)":"FrankKarlitschek","body":"More and more people store their personal files and documents in cloud services like Dropbox, Google Drive, Skydrive or iCloud. The reason is that they provide convenient features to sync your...","Experience level":"Intermediate"}},{"node":{"Session":"DIY Electric Vehicles","Speaker(s)":"bkero","body":"Everybody today has heard of electric vehicles, yet almost nobody has ever seen one, touched one, or driven one. I think this is a shame and would like to correct that.","Experience level":"Beginner"}},{"node":{"Session":"Django Carrots - building an open programming tutorial for beginners.","Speaker(s)":"kstepniowska, sguermond","body":"We started to build Django Carrots workshop and tutorial in 2012 as a Geek Girls Carrots program. We would like to share our knowledge and experience in:","Experience level":""}},{"node":{"Session":"Document Your World with Markdown","Speaker(s)":"sboisen","body":"Markdown is a simple system for adding formatting information to plain text documents. It's both easy to read and easy to write, so many projects use Markdown as their formatting language of...","Experience level":"Beginner"}},{"node":{"Session":"E-Mail via Bitmessage","Speaker(s)":"alexmat","body":"Setup Bitmessage as your back-end mail transport and talk over the Bitmessage network using any exisiting e-mail client!","Experience level":"Intermediate"}},{"node":{"Session":"Elegant and Efficient Python","Speaker(s)":"steveha","body":"As Mark Twain (almost) said, the difference between elegant Python and clumsy Python is the difference between lightning and a lightning bug.  This talk will show you how to write beautiful...","Experience level":"Intermediate"}},{"node":{"Session":"Encryption as Free Speech, ACLU","Speaker(s)":"tjaredfriend","body":"A overview of the cryptowars, a summary of recent attempts to undermine public access to engage in secure communication, and a call for application of free spech principles to the use of...","Experience level":"Beginner"}},{"node":{"Session":"Exploring MySQL Join Types – INNER, OUTER, and much more.","Speaker(s)":"SteveStedman","body":"Joining tables is one of the fundamental aspects of any relational database, but the different ways of joining tables are often misunderstood.","Experience level":"Intermediate"}},{"node":{"Session":"Getting things done with Ansible automation","Speaker(s)":"jkeating","body":"Getting things done shouldn't be hard. Your config management system shouldn't need a config management system to manage it. Come hear about something better, something simple, something powerful...","Experience level":"Beginner"}},{"node":{"Session":"How SUSE is helping you rock the cloud","Speaker(s)":"bear454","body":"SUSE is putting a lot of effort into making sure users of both SUSE Linux Enterprise Server, and openSUSE have the best experience running virtual machines in public clouds, like Amazon EC2,...","Experience level":"Advanced"}},{"node":{"Session":"How To Manage Logging Across Many Systems","Speaker(s)":"esh","body":"Linux systems are great at generating logs.  Syslog is also great for receiving and routing log messages throughout an enterprise environment.  The benefit of logs is the breadth and variety of...","Experience level":"Intermediate"}},{"node":{"Session":"Humanitarian Hacking for Fun and Profit","Speaker(s)":"lishevita","body":"Geeks Without Bounds is a nonprofit organization that supports humanitarian open source projects through a combination of hackathons and an accelerator program.","Experience level":""}},{"node":{"Session":"ICS - Major System Crash - What Happens Next","Speaker(s)":"ski98033","body":"I propose a talk on the how to apply the Incident Command System (ICS) to System Administrators. ICS is a standard management hierarchy and procedures for managing temporary incidents of any size...","Experience level":""}},{"node":{"Session":"Intro to Docker","Speaker(s)":"csberg","body":"Overview of how Docker can be used in a web software development environment for rapid creation and easy to deploy environments across a distibuted development team. The same techniques can be...","Experience level":"Beginner"}},{"node":{"Session":"Introducing new Features for MariaDB 10.1","Speaker(s)":"montywi","body":"Come hear Monty talk about the new features in MariaDB 10.1","Experience level":"Intermediate"}},{"node":{"Session":"Introduction to OpenStack","Speaker(s)":"nibalizer","body":"OpenStack is Open Source Cloud Software: https:\/\/www.openstack.org\/","Experience level":"Beginner"}},{"node":{"Session":"Kaltura - the open source video platform","Speaker(s)":"jess","body":"Kaltura is a LAMP based platform that manages all media operations starting from optimizing source videos for various devices and up to user interfaces for management and playback.","Experience level":"Intermediate"}},{"node":{"Session":"Let's Encrypt: A Free Robotic Certificate Authority","Speaker(s)":"schoen","body":"We want web sites and other Internet services to use encryption.  It's essential for privacy and security on an Internet that we're discovering is increasingly untrustworthy.","Experience level":"Intermediate"}},{"node":{"Session":"Leveraging Linux platform for Identity Management in Enterprise Web Applications","Speaker(s)":"nkinder","body":"Many Web-based applications are initially developed with only limited attention to user management.","Experience level":"Intermediate"}},{"node":{"Session":"libreCMC : The libre Embedded GNU\/Linux distro","Speaker(s)":"RISCi_ATOM","body":"libreCMC is a libre embedded GNU\/Linux distro for devices with limited resources and general purpose computers. In the future, libreCMC plans to target routers, phones, tablets, servers and high...","Experience level":"Intermediate"}},{"node":{"Session":"LibreOffice for Android: The Green + Green Tag-Team","Speaker(s)":"qubit","body":"After countless inquiries by users just like you, LibreOffice has finally arrived on the Android platform! Now the green robot can handle tons of office file formats -- and it's all Free Software...","Experience level":"Beginner"}},{"node":{"Session":"Linux Troubleshooting: Digging Deeper and Understanding the Data","Speaker(s)":"mralexjuarez","body":"Time slot: 50 Minutes","Experience level":"Beginner"}},{"node":{"Session":"Log Analysis with the ELK stack (Elasticsearch, Logstash, Kibana)","Speaker(s)":"greptile","body":"It’s your first day at the new job and your new manager swings by your desk to tell you about your first assignment. You’re going to be in charge of log management and log...","Experience level":"Intermediate"}},{"node":{"Session":"Meeting Ubuntu","Speaker(s)":"Daddou","body":"This session will be about getting started with Ubuntu and overview on Ubuntu as a development framework. ","Experience level":"Beginner"}},{"node":{"Session":"Modern PHP Development: PSRs, Composer, HHVM, Hack and closures, oh my!","Speaker(s)":"emalone","body":"Was the last time you used PHP back in 5.2 (or earlier)? Did you abandon it for trendier, more modern scripting languages and frameworks? Get caught up on what open source projects and big name...","Experience level":"Beginner"}},{"node":{"Session":"Networking for linux geeks","Speaker(s)":"Francois Caen","body":"When I started my career transition from linux sysadmin to network engineer, I thought I had a good understanding of networking: I knew  enough about ports and IPs to set up iptables or read an...","Experience level":"Intermediate"}},{"node":{"Session":"Online Security, Privacy and Password Management","Speaker(s)":"lufthans","body":"Tools and tips for giving you control over your online security and privacy. Continuing breaches at high-profile sites prove that you can't rely on cloud services to protect your accounts.","Experience level":"Beginner"}},{"node":{"Session":"Open Hardware and why it matters - MinnowBoard MAX case study","Speaker(s)":"warthog9","body":"Open Hardware is starting to change the way the world works, giving more people access to customizable hardware, and giving more power to smaller entities.","Experience level":"Beginner"}},{"node":{"Session":"OpenStack -- Not just for Public Clouds!","Speaker(s)":"jkeating","body":"OpenStack is a well known open source cloud platform providing compute, networking, storage, and other tools as a programmable service.","Experience level":"Intermediate"}},{"node":{"Session":"OpenVZ, Virtuozzo Core, and Docker","Speaker(s)":"kir","body":"The OpenVZ\/Virtuozzo developers from Parallels have been working on Linux container technologies since 1999. What was originally a separate patchset is now mostly merged into the upstream Linux...","Experience level":"Intermediate"}},{"node":{"Session":"Patents and Copyright and Trademarks: A Primer for Developers","Speaker(s)":"eximious","body":"There's a constellation of legal constructs that you often hear referred to collectively as \"intellectual property law.\" That's a tricky term because it encourages you to think of these three...","Experience level":""}},{"node":{"Session":"Peeling Back the Layers of the Network with Security Onion","Speaker(s)":"greptile","body":"Security Onion is a Linux distribution for intrusion detection, network security monitoring (NSM), and log management.","Experience level":"Intermediate"}},{"node":{"Session":"Pop Open a Kernel","Speaker(s)":"iankronquist","body":"Ever wanted to build a simple kernel for a small computer like a raspberry pi? Curious how an OS starts and how it communicates with your keyboard and screen? Together, we'll build a simple arm...","Experience level":"Intermediate"}},{"node":{"Session":"PostgreSQL Federation: Joining to Oracle, Mongo and more...","Speaker(s)":"jimmy76","body":"As more and more alternative data stores come into use, the problem of being able to easily use and report on the data scattered across those data stores becomes increasingly difficult.","Experience level":"Beginner"}},{"node":{"Session":"PostgreSQL Performance Presentation (9.5devel edition) ","Speaker(s)":"markwkm","body":"This presentation will take a look at the performance changes in the development version of PostgreSQL.  A selection of features, some proposed and some already committed, are evaluated using...","Experience level":"Advanced"}},{"node":{"Session":"RC Quadctopers 101: Building and Setup with APM Mission Planner","Speaker(s)":"AaronBuma","body":"RC Quadcopters, or multirotors, were on just about everyone's Christmas list last month. If Santa's present has left you wanting for more (or you just want to tinker!), but you don't know where to...","Experience level":"Beginner"}},{"node":{"Session":"Recruiting and retaining dedicated volunteers","Speaker(s)":"stephelhajj","body":"Volunteer work is exhausting, time consuming, and many times, thankless. So why do we do it?","Experience level":"Beginner"}},{"node":{"Session":"Sharding your MySQL\/MariaDB data with Spider","Speaker(s)":"maxmether","body":"When your data sizes starts reaching Big Data limits sharding becomes a necessity. However sharding can also be needed for other reasons like dealing with huge amounts of traffic etc.","Experience level":"Intermediate"}},{"node":{"Session":"Shootout at the PAAS Corral","Speaker(s)":"jberkus","body":"Where should you run your PostgreSQL in the cloud?  Join us for a comparison of features, pricing and performance between various cloud options, including most or all of EC2, Amazon RDS, Heroku,...","Experience level":"Beginner"}},{"node":{"Session":"Single System Fundamentals","Speaker(s)":"wyman.lucy","body":"Wondering what to do when you open up a shell?  Wondering what a shell even is?  In this talk we'll go over the basics of  getting around your filesystem, managing user accounts, and using a ...","Experience level":"Beginner"}},{"node":{"Session":"Software Patent Litigation: What Have We Learned?","Speaker(s)":"eximious","body":"The huge increase in software patent litigation over the last 15 years has produced reams of articles, cost fortunes and even snagged the US President's attention.","Experience level":""}},{"node":{"Session":"Start_Date, End_Date: Calculate!  Mastering Dates in SQL","Speaker(s)":"ericcmd","body":"Date ranges seem so simple, yet they can be among the more vexing aspects of data design and SQL reporting.","Experience level":"Intermediate"}},{"node":{"Session":"The Bare-Metal Hypervisor as a Platform for Innovation","Speaker(s)":"rcpavlicek","body":"Unlike some hypervisors which run within a host operating system, or containers which share an operating system base, bare-metal hypervisors enable possible solutions with ultra-light footprints...","Experience level":"Beginner"}},{"node":{"Session":"The Dark Arts of SSH","Speaker(s)":"bkero","body":"Many think that SSH is only a tool to get a shell on a remote computer. In fact, SSH has a powerful array of features unique to it that can help protect privacy and security over insecure...","Experience level":"Intermediate"}},{"node":{"Session":"The Free Software Foundation Licensing & Compliance Lab; We Fight for the User","Speaker(s)":"donaldr3","body":"An overview of the work we do at the Free Software Foundation Licensing & Compliance Lab, from helping the community understand licensing to fighting to protect users against threats like...","Experience level":"Beginner"}},{"node":{"Session":"The Next Generation Cloud: Unleashing the Power of the Unikernel","Speaker(s)":"rcpavlicek","body":"Docker has sparked much excitement over the concept of small, easily deployable VMs. But unikernels create even smaller VMs with much higher security than container-based solutions.","Experience level":"Beginner"}},{"node":{"Session":"The Recipe to Getting Attendees to your Open Source Events","Speaker(s)":"karenvuong","body":"The Recipe to Getting Attendees to your Open Source Events","Experience level":""}},{"node":{"Session":"Thinking in Git","Speaker(s)":"edunham","body":"Git is the most popular source code management and version control system in the open source community. Its complexity and power make it the best choice for most projects, while simultaneously...","Experience level":"Beginner"}},{"node":{"Session":"Vacuum 101","Speaker(s)":"gorthx","body":"Autovacuum’s like a Roomba, right? You just turn it on and it does all the work for you. Well, not quite – for one, your pets can’t ride around on it – and occasionally it may get stuck in a (...","Experience level":"Beginner"}},{"node":{"Session":"Weasel Your Way to the Top: How to Handle a Technical Interview","Speaker(s)":"Sorthum","body":"Many technologists are very proficient at solving complex technical challenges. Yet, they feel utterly lost in an interview situation, simply because it's not an occurrence that happens frequently...","Experience level":""}},{"node":{"Session":"Web-Scale PostgreSQL: The Best of the JSON and Relational Worlds","Speaker(s)":"jimmy76","body":"Title: Web-Scale PostgreSQL: The Best of the JSON and Relational Worlds\n\n\t \n\n\tDescription:\n","Experience level":"Intermediate"}},{"node":{"Session":"Webscale's dead; long live PostgreSQL!","Speaker(s)":"linuxhiker","body":"Those of us who know PostgreSQL know that we are royalty.  Yes, yes, let's be humble. We are \"a\" royal.  But we are royalty of AWESOME.  Yes, our technology base is over 40 years ago but what a 40...","Experience level":"Intermediate"}},{"node":{"Session":"Webserver Security - Identifying Risks","Speaker(s)":"CSaunders","body":"Protecting data hosted on a webserver can be a daunting task. Developing strategies for identifying potential vulnerabilities can provide vital information on security issues in a webserver or...","Experience level":"Intermediate"}},{"node":{"Session":"Welcome Debian 8.0: Aptly Cloudy Aptitude","Speaker(s)":"j@bureado.com","body":"Let's welcome the new release of Debian 8.0 \"jessie\"! Whether you're new to Debian or not, join us for: 1) cake, 2) learn about the \"Big 8 in 8\" and 3) a journey from a metapackage to a cloud-...","Experience level":"Beginner"}},{"node":{"Session":"Welcome To Total Security","Speaker(s)":"robert_zulu","body":"Protecting your data, by any and all means possible, is no longer an option. Rather, it is mandated by today's security conscious management.","Experience level":"Advanced"}},{"node":{"Session":"What's New in FreeNAS 9.3","Speaker(s)":"dlavigne","body":"This presentation will provide an overview of some of the many new features in FreeNAS 9.3. FreeNAS is an open source NAS based on FreeBSD. The new features include:","Experience level":"Beginner"}},{"node":{"Session":"Where We Were, Are, & Will Be: a look back at Lessig's 2002 OSCON keynote","Speaker(s)":"William","body":"The open source community has come a long way since the term was coined in 1998. We have users and abusers, at home, work, and all those in-between, a community built upon innovation and interest...","Experience level":""}},{"node":{"Session":"Why's My Program Slow? Algorithmic Complexity and You","Speaker(s)":"edunham","body":"When you're new to programming, or self-taught with an emphasis on those topics that are directly relevant to your current project, it's easy to skip learning about analyzing the complexity of...","Experience level":"Beginner"}},{"node":{"Session":"Windows is AWESOME","Speaker(s)":"BryanLunduke","body":"Listen up all you neck-bearded, hippy-dippy Linux nerds! You think Linux is all that and a bag of chips? Well, you're wrong. Windows is the true king of awesome operating systems.","Experience level":"Beginner"}}]}